{
  "title": "Younes Laaroussi: Fullstack/Mobile Engineer",
  "role": "Fullstack + mobile developer",
  "tagline": "As a fullstack and mobile developer, I prioritize creating solid and scalable products with great user experiences.",
  "descriptions": [
    "I prioritize solid and scalable products with great UX",
    "I have built successful products for clients worldwide"
  ],
  "home-button": "Logo, go to homepage.",
  "headshot-alt": "Headshot of Younes Laaroussi",
  "design": {
    "title": "Web Fullstack",
    "description": "As a full-stack web developer, I aim to create robust and scalable applications that provide great user experiences. I enjoy working on both front-end and back-end development, and I'm always looking to improve my skills and stay up-to-date with the latest trends and technologies. My goal is to deliver high-quality products that exceed users' expectations."
  },
  "engineering": {
    "title": "Mobile and Cloud",
    "description": "As a cross-platform mobile developer, I use React Native to create high-quality mobile apps for both iOS and Android. With experience in API development, GCP, and Docker, I create efficient and scalable solutions for mobile and web apps, focusing on user-friendly APIs and cloud infrastructure for optimal performance. My goal is to provide seamless user experiences across multiple platforms."
  },
  "story": {
    "title": "Over the years,",
    "content": "Over the years, I have built a diverse portfolio of projects and articles that showcase my expertise as a developer. I created a Tailwind Components Library, which includes reusable components for building user interfaces. I also built a video chat application that utilized Twilio and TensorFlow for 3D mask effects, and wrote an article about it for Twilio that earned me $750.\n\nAdditionally, I built a Figma design quotes widget that scraped an existing API, and wrote an article about it for CSS Tricks that earned me $300. I also created a bikes API for Cyclic and wrote documentation for it. For CSS Tricks, I wrote another article about technical writing and received $300.\n\nOne of my most successful projects was a collection of 100 CSS buttons that earned over 3,000 stars on GitHub. I also created a collection of CSS cheatsheets that earned top place in the Reddit WebDev community. In 2021, I was recognized as the top writer of the year for Dev.to, a global developer community.\n\nI am experienced in building mobile applications using React Native and have built an app that generates new pictures using Dreambooth, which has its own API. Additionally, I built an eCommerce website using Medusa and Next.js with a backend hosted on GCP load balancers.\n\nCurrently, I am working on a mobile app called DeepShot that uses AI to generate and edit photographs. Lastly, I built an advanced input form for Vue.js, which has over 200 stars on GitHub. These projects and experiences have helped me become a well-rounded and experienced developer."
  },
  "work-link": {
    "title": "I build & design stuff",
    "description": "Open source projects, web apps and experimentals.",
    "link": "See my work",
    "value": "https://work.eluda.dev"
  },
  "blog-link": {
    "title": "I write, sometimes",
    "description": "About design, development, learning and life.",
    "link": "See my articles",
    "value": "https://shelf.eluda.dev"
  },
  "contact": {
    "title": "Send me a message!",
    "description": "Got a question or proposal, or just want to say hello? Go ahead.",
    "name": {
      "title": "Your name",
      "placeholder": "Enter your name"
    },
    "email": {
      "title": "Email address",
      "placeholder": "Enter your email address"
    },
    "message": {
      "title": "Your message",
      "placeholder": "Hi, I think we need a design system for our products at Company X. How soon can you hop on to discuss this?"
    },
    "submit": "Shoot",
    "link": "https://formspree.io/f/mvonljaq"
  },
  "links": {
    "title": "Say hello",
    "email": {
      "title": "Email",
      "display": "hello@eluda.dev",
      "value": "mailto:hello@eluda.dev"
    },
    "telegram": {
      "title": "Telegram link",
      "display": "t.me/eludadev",
      "value": "https://t.me/eludadev"
    },
    "work": {
      "title": "My Work",
      "display": "My Work",
      "value": "https://work.eluda.dev"
    },
    "shelf": {
      "title": "My Shelf",
      "display": "My Shelf",
      "value": "https://shelf.eluda.dev"
    },
    "resume": {
      "title": "My Résumé",
      "display": "My Résumé"
    },
    "github": {
      "title": "Github",
      "display": "GH",
      "value": "https://github.com/eludadev"
    },
    "linkedin": {
      "title": "LinkedIn",
      "display": "LN",
      "value": "https://www.linkedin.com/in/eludadev/"
    }
  },
  "footer": "© Younes Laaroussi 2023",
  "resume": {
    "name": "Younes Laaroussi",
    "title": "Expert Full Stack Web, Mobile and Cloud Developer.",
    "subtitle": "Experienced web developer with expertise in mobile and cloud development. Passionate about creating high-performance, accessible web experiences using user-friendly and scalable designs. In personal projects, I prioritize creative and innovative approaches while maintaining a focus on practicality and usability.",
    "experience": {
      "title": "Experience",
      "subtitle": "I’ve worked on a handful of technical projects over the years, some of which were for the following organizations:",
      "jobs": [
        {
          "company": "Twilio",
          "position": "Contract Software Developer",
          "duration": "Jan 2023",
          "description": "By integrating the Twilio video chat API and implementing TensorFlow to create 3D mask effects, we have enabled a functional and visually appealing video chat experience that has the potential to positively impact billions of users around the world.",
          "milestones": [
            "Successfully integrating the Twilio video chat API into the application.",
            "Implementing TensorFlow to create 3D mask effects during video chat.",
            "Writing a detailed and informative article about the project for Twilio's publication.",
            "Receiving payment of $750 for the article from Twilio.",
            "Demonstrating a functional and visually appealing video chat application to stakeholders.",
            "Receiving positive feedback from users and stakeholders about the Twilio video chat application."
          ]
        },
        {
          "company": "Cyclic",
          "position": "Contract Backend Engineer",
          "duration": "July 2022",
          "description": "My experience with the Cyclic Company allowed me to work on various exciting projects, ranging from building APIs to developing web applications. Through my work, I gained expertise in different technologies, such as serverless infrastructure and npm packages, and improved my technical writing skills. I am proud of the milestones I achieved during my time with Cyclic and look forward to applying my learnings to future projects.",
          "milestones": [
            "Successfully built a Bikes API for Cyclic, for which I was paid $200.",
            "Created a comprehensive, multi-page documentation for the Bikes API that goes over the servers and Cyclic's serverless infrastructure and their npm packages.",
            "Built a record-saving dashboard for Cyclic that allows users to save and view their bike records easily.",
            "Designed and developed a demo social media app for Cyclic that showcases the features of their API.",
            "Developed a demonstrative API for Cyclic that provides users with an easy-to-use interface to interact with the API.",
            "Wrote detailed articles about each of these projects, explaining the technical aspects and features of the projects.",
            "Effectively communicated with the Cyclic team to understand their requirements and deliver projects that met their needs.",
            "Utilized my expertise in software development to ensure that all projects were developed efficiently, effectively, and with high-quality code.",
            "Contributed to the growth of Cyclic's development team by sharing my knowledge and experience with other developers.",
            "Received positive feedback from the Cyclic team and users about the Bikes API, dashboard, social media app, and API projects."
          ]
        },
        {
          "company": "CSS Tricks",
          "position": "Contract Technical Writer",
          "duration": "May 2022",
          "description": "One of my notable achievements with CSS-Tricks was building a Figma design quotes widget that scraped an existing API, and writing an article about it that was featured on the site. Through this project, I had the opportunity to work with industry professionals and pitch my article idea to the CSS-Tricks team. The article was well-received and even praised by a member of the Figma team. Additionally, I wrote an article about technical writing that was published on the site, and I am currently working on an article about building a todos API for DigitalOcean, which owns CSS-Tricks.",
          "milestones": [
            "Built a Figma design quotes widget that scraped an existing API.",
            "Wrote an informative article about the design quotes widget for CSS Tricks.",
            "Was paid $300 by CSS Tricks for the design quotes widget article.",
            "Wrote an article about technical writing for CSS Tricks.",
            "Was paid $300 by CSS Tricks for the technical writing article.",
            "Built a todos API for DigitalOcean, which owns CSS Tricks.",
            "In progress of writing an informative article about the todos API for CSS Tricks.",
            "Set up a strong working relationship with CSS Tricks and DigitalOcean through successful project completion."
          ]
        }
      ]
    },
    "projects": {
      "title": "Projects",
      "subtitle": [
        "Links to some of my work can be found on",
        {
          "text": "work.eluda.dev",
          "link": "https://work.eluda.dev"
        },
        "and details can be provided upon request via a scheduled demo call."
      ]
    },
    "core-tech": {
      "title": "Core Technologies:",
      "items": [
        "JavaScript",
        "React",
        "CSS-in-JS",
        "TypeScript",
        "Vue.js",
        "Sass",
        "NestJS",
        "ESLint",
        "GCP",
        "AWS",
        "NodeJS",
        "Docker",
        "React Native",
        "Expo",
        "Next.js"
      ]
    },
    "others": {
      "title": "Others:",
      "items": [
        "Design Systems",
        "E2E Testing",
        "PWAs",
        "Load Balancers",
        "Performance Optimization",
        "Software Testing",
        "SE Optimization",
        "Progressive Enhancement",
        "Accessibility auditing",
        "Build Automation",
        "Responsive Web Design",
        "UX Design/Strategy"
      ]
    },
    "profile": {
      "website": {
        "display": "eluda.dev",
        "title": "Website",
        "link": "https://eluda.dev"
      },
      "location": "Morocco, Rabat",
      "email": {
        "display": "hello@eluda.dev",
        "title": "Email address",
        "link": "mailto:hello@eluda.dev"
      }
    },
    "download": {
      "link": "https://eluda.dev/resume.pdf",
      "title": "Download"
    }
  }
}
