{
  "title": "Younes Laaroussi: Fullstack/Mobile Engineer",
  "role": "Frontend\nDeveloper.",
  "tagline": "I like to craft solid and scalable frontend products with great user experiences.",
  "descriptions": [
    "Highly skilled at progressive enhancement, design systems & UI Engineering.",
    "Proven experience building successful products for clients across several countries."
  ],
  "home-button": "Logo, go to homepage.",
  "headshot-alt": "Headshot of Younes Laaroussi",
  "design": {
    "title": "Design",
    "description": "I'm probably not the typical designer positioned behind an Illustrator artboard adjusting pixels, but I design. Immersed in stylesheets tweaking font sizes and contemplating layouts is where you'll find me (~_^). I'm committed to creating fluent user experiences while staying fashionable."
  },
  "engineering": {
    "title": "Engineering",
    "description": "In building JavaScript applications, I'm equipped with just the right tools, and can absolutely function independently of them to deliver fast, resilient solutions optimized for scale — performance and scalabilty are priorities on my radar."
  },
  "story": {
    "title": "Over the years,",
    "content": "I've built products for companies and businesses around the globe ranging from marketing websites to complex solutions and enterprise apps with focus on fast, elegant and accessible user experiences.\n\nCurrently, I work at Shopify as a Senior Frontend Engineer crafting thoughtful and inclusive experiences that adhere to web standards for over 3 million merchants across the world.\n\nBefore now, I was Principal Frontend Engineer at hellotax, where I worked on a suite of tools and services tailored towards automated VAT compliance for multi-channel sellers in Europe.\n\nPrior to hellotax, I was Senior frontend engineering consultant with Pixel2HTML, building JavaScript applications and interfaces for orgs and individuals.\n\nI once also led the frontend team at Conectar, an e-learning startup through building multiple React applications into a single robust learning platform."
  },
  "work-link": {
    "title": "I build & design stuff",
    "description": "Open source projects, web apps and experimentals.",
    "link": "See my work"
  },
  "blog-link": {
    "title": "I write, sometimes",
    "description": "About design, frontend dev, learning and life.",
    "link": "See my articles"
  },
  "contact": {
    "title": "Send me a message!",
    "description": "Got a question or proposal, or just want to say hello? Go ahead.",
    "name": {
      "title": "Your name",
      "placeholder": "Enter your name"
    },
    "email": {
      "title": "Email address",
      "placeholder": "Enter your email address"
    },
    "message": {
      "title": "Your message",
      "placeholder": "Hi, I think we need a design system for our products at Company X. How soon can you hop on to discuss this?"
    },
    "submit": "Shoot",
    "link": "https://formspree.io/f/mvonljaq"
  },
  "links": {
    "title": "Say hello",
    "email": {
      "title": "Email",
      "display": "hello@eluda.dev",
      "value": "mailto:hello@eluda.dev"
    },
    "telegram": {
      "title": "Telegram link",
      "display": "t.me/eludadev",
      "value": "https://t.me/eludadev"
    },
    "work": {
      "title": "My Work",
      "display": "My Work",
      "value": ""
    },
    "shelf": {
      "title": "My Shelf",
      "display": "My Shelf",
      "value": ""
    },
    "resume": {
      "title": "My Résumé",
      "display": "My Résumé",
      "value": ""
    },
    "github": {
      "title": "Github",
      "display": "GH",
      "value": ""
    },
    "linkedin": {
      "title": "LinkedIn",
      "display": "LN",
      "value": ""
    }
  },
  "footer": "© Olaolu Olawuyi 2023",
  "resume": {
    "name": "Olaolu Olawuyi",
    "title": "Expert Frontend developer and UX Engineer.",
    "subtitle": "Engineer valued for driving high-performance accessible web experiences. I design quality, user-friendly and scalable products regardless of stack.",
    "experience": {
      "title": "Experience",
      "subtitle": "I’ve worked on a handful of web projects over the years, some of which were for the following organizations:",
      "jobs": [
        {
          "company": "Shopify",
          "position": "Senior Frontend Engineer",
          "duration": "May 2020 - Present",
          "description": "Shaping the future of commerce and entrepreneurship – building and advocating for inclusive and thoughtful experiences for over three million merchants across the globe.",
          "milestones": [
            "Pioneering initiatives around the future of onboarding, signup and developing technical vision for them",
            "Identified a gap in my team’s deployment workflow and built a solution that reduced the time required for each deployment from over 40 minutes to less than 6 minutes, which restores almost 300 hours of developer productivity every year",
            "Collaborating with UX designers and researchers to inform the direction of products we craft",
            "First-hand involvement in early-stage product and UX thinking and rapid prototyping",
            "Conducting and monitoring several strategic experiments, refining experiences based on resulting metrics and learnings",
            "Participating and incorporating learnings from real merchant interviews and research sessions",
            "Identifying gaps around the org-wide frontend infrastructure, drafting proposals and implementing solutions",
            "Mentoring engineers within and outside my team on best practices, performance and advanced patterns",
            "Providing guidance around product accessibility and inclusivity across the org",
            "Built an OAuth 2.0 compliant client-side library for our Identity provider across Shopify"
          ]
        },
        {
          "company": "MOONDA",
          "position": "Senior Frontend Engineer",
          "duration": "Nov 2018 - Jan 2019",
          "description": "I worked with MOONDA via Pixel2HTML to create the web experience for John Deere's ATU 300 product.",
          "milestones": [
            "Built a contest application from the ground up using React which enabled users of the product from all around the globe to post photos and share reviews about the product.",
            "Designed and implemented a cross-browser, IE 11 compatible marketing site for the product.",
            "Implemented internationalization on the website with support for over 40 languages.",
            "Implemented automatic locale detection (with proper redirection based on that) and locale-specific content filtering."
          ]
        }
      ]
    },
    "projects": {
      "title": "Projects",
      "subtitle": [
        "Links to some of my work can be found on",
        {
          "text": "olaolu.dev/work",
          "link": "https://olaolu.dev/work"
        },
        "and details can be provided upon request via a scheduled demo call."
      ]
    },
    "core-tech": {
      "title": "Core Technologies:",
      "items": [
        "JavaScript",
        "React",
        "CSS-in-JS",
        "TypeScript",
        "Vue.js",
        "Sass",
        "Flux",
        "ESNext",
        "Flow",
        "NodeJS",
        "GraphQL",
        "LessCSS",
        "Next.js"
      ]
    },
    "others": {
      "title": "Others:",
      "items": [
        "Design Systems",
        "E2E Testing",
        "PWAs",
        "Performance Optimization",
        "Software Testing",
        "SE Optimization",
        "Progressive Enhancement",
        "Accessibility auditing",
        "Build Automation",
        "Responsive Web Design",
        "UX Design/Strategy"
      ]
    },
    "profile": {
      "website": {
        "display": "eluda.dev",
        "title": "Website",
        "link": "https://eluda.dev"
      },
      "location": "Lagos, Nigeria",
      "email": {
        "display": "hello@eluda.dev",
        "title": "Email address",
        "link": "mailto:hello@eluda.dev"
      }
    },
    "download": {
      "link": "",
      "title": "Download"
    }
  }
}
